Revit 2024 API
BuiltInFailures.GenericMEPFailures.ValidatePHSegmentLengthWarning Property
 The placeholder curve is not long enough to support the required fittings for placeholder convert
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ValidatePHSegmentLengthWarning { get; }
Visual Basic
Public Shared ReadOnly Property ValidatePHSegmentLengthWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ValidatePHSegmentLengthWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GenericMEPFailures Class
Autodesk.Revit.DB Namespace